# 1. Handling Missing Data

### Import Required Libraries

In [1]:
import pandas as pd
import numpy as np

### Create DataFrame

In [2]:
missing_data_df = pd.DataFrame(
    {
        "Students": ["Tom", "Peter",np.nan, "Mary", "Tom","King","Tom","Mary",np.nan],
        "Exam_Date": ["15/01/2021", "16/01/2021", "19/01/2021", "27/01/2021", "16/01/2021",
                      "16/01/2021", "16/01/2021", "16/01/2021", "16/01/2021"],
        "Math": [79.00, 67.00,np.nan, np.nan, 70.00,np.nan,90.00,76.00,np.nan],
        "Physics":[63.00, np.nan, 60.00, np.nan,84.00, 77.00,55.00,np.nan,66.00],
        "Computer":[np.nan,78.00, 57.00, 88.00, np.nan,np.nan,np.nan,70.00,np.nan],
    }
)

missing_data_df

  Students   Exam_Date  Math  Physics  Computer
0      Tom  15/01/2021  79.0     63.0       NaN
1    Peter  16/01/2021  67.0      NaN      78.0
2      NaN  19/01/2021   NaN     60.0      57.0
3     Mary  27/01/2021   NaN      NaN      88.0
4      Tom  16/01/2021  70.0     84.0       NaN
5     King  16/01/2021   NaN     77.0       NaN
6      Tom  16/01/2021  90.0     55.0       NaN
7     Mary  16/01/2021  76.0      NaN      70.0
8      NaN  16/01/2021   NaN     66.0       NaN

###### Show null values and return false if not null

In [3]:
missing_data_df.isnull().head()

   Students  Exam_Date   Math  Physics  Computer
0     False      False  False    False      True
1     False      False  False     True     False
2      True      False   True    False     False
3     False      False   True     True     False
4     False      False  False    False      True

###### Show count of null values

In [4]:
missing_data_df.isnull().sum()

Students     2
Exam_Date    0
Math         4
Physics      3
Computer     5
dtype: int64

###### Show not null values and return true if not null

In [5]:
missing_data_df.notnull().head()

   Students  Exam_Date   Math  Physics  Computer
0      True       True   True     True     False
1      True       True   True    False      True
2     False       True  False     True      True
3      True       True  False    False      True
4      True       True   True     True     False

### 1.  Deleting records with missing values
###### Drop entire row with all values null

In [6]:
missing_data_df.dropna(how='all')

  Students   Exam_Date  Math  Physics  Computer
0      Tom  15/01/2021  79.0     63.0       NaN
1    Peter  16/01/2021  67.0      NaN      78.0
2      NaN  19/01/2021   NaN     60.0      57.0
3     Mary  27/01/2021   NaN      NaN      88.0
4      Tom  16/01/2021  70.0     84.0       NaN
5     King  16/01/2021   NaN     77.0       NaN
6      Tom  16/01/2021  90.0     55.0       NaN
7     Mary  16/01/2021  76.0      NaN      70.0
8      NaN  16/01/2021   NaN     66.0       NaN

###### Drop column with any null value

In [7]:
missing_data_df.dropna(how='any',axis=1)

    Exam_Date
0  15/01/2021
1  16/01/2021
2  19/01/2021
3  27/01/2021
4  16/01/2021
5  16/01/2021
6  16/01/2021
7  16/01/2021
8  16/01/2021

###### Drop rows with any of specified columns have null

In [8]:
missing_data_df.dropna(subset=['Math', 'Physics'], how='any')

  Students   Exam_Date  Math  Physics  Computer
0      Tom  15/01/2021  79.0     63.0       NaN
4      Tom  16/01/2021  70.0     84.0       NaN
6      Tom  16/01/2021  90.0     55.0       NaN

###### Drop rows with all of specified columns have null

In [9]:
missing_data_df.dropna(subset=['Math', 'Physics'], how='all')

  Students   Exam_Date  Math  Physics  Computer
0      Tom  15/01/2021  79.0     63.0       NaN
1    Peter  16/01/2021  67.0      NaN      78.0
2      NaN  19/01/2021   NaN     60.0      57.0
4      Tom  16/01/2021  70.0     84.0       NaN
5     King  16/01/2021   NaN     77.0       NaN
6      Tom  16/01/2021  90.0     55.0       NaN
7     Mary  16/01/2021  76.0      NaN      70.0
8      NaN  16/01/2021   NaN     66.0       NaN

###### Drop row with a given number of null values

In [10]:
missing_data_df.dropna(axis=1,thresh=2)

  Students   Exam_Date  Math  Physics  Computer
0      Tom  15/01/2021  79.0     63.0       NaN
1    Peter  16/01/2021  67.0      NaN      78.0
2      NaN  19/01/2021   NaN     60.0      57.0
3     Mary  27/01/2021   NaN      NaN      88.0
4      Tom  16/01/2021  70.0     84.0       NaN
5     King  16/01/2021   NaN     77.0       NaN
6      Tom  16/01/2021  90.0     55.0       NaN
7     Mary  16/01/2021  76.0      NaN      70.0
8      NaN  16/01/2021   NaN     66.0       NaN

### 2. Imputation
###### Replace null values with a scalar value

In [11]:
missing_data_df.fillna(-999) # replace null values with -999

  Students   Exam_Date   Math  Physics  Computer
0      Tom  15/01/2021   79.0     63.0    -999.0
1    Peter  16/01/2021   67.0   -999.0      78.0
2     -999  19/01/2021 -999.0     60.0      57.0
3     Mary  27/01/2021 -999.0   -999.0      88.0
4      Tom  16/01/2021   70.0     84.0    -999.0
5     King  16/01/2021 -999.0     77.0    -999.0
6      Tom  16/01/2021   90.0     55.0    -999.0
7     Mary  16/01/2021   76.0   -999.0      70.0
8     -999  16/01/2021 -999.0     66.0    -999.0

###### Backward Fill

In [12]:
missing_data_df.fillna(method='bfill')

  Students   Exam_Date  Math  Physics  Computer
0      Tom  15/01/2021  79.0     63.0      78.0
1    Peter  16/01/2021  67.0     60.0      78.0
2     Mary  19/01/2021  70.0     60.0      57.0
3     Mary  27/01/2021  70.0     84.0      88.0
4      Tom  16/01/2021  70.0     84.0      70.0
5     King  16/01/2021  90.0     77.0      70.0
6      Tom  16/01/2021  90.0     55.0      70.0
7     Mary  16/01/2021  76.0     66.0      70.0
8      NaN  16/01/2021   NaN     66.0       NaN

###### Forward Fill

In [13]:
missing_data_df.fillna(method='ffill')

  Students   Exam_Date  Math  Physics  Computer
0      Tom  15/01/2021  79.0     63.0       NaN
1    Peter  16/01/2021  67.0     63.0      78.0
2    Peter  19/01/2021  67.0     60.0      57.0
3     Mary  27/01/2021  67.0     60.0      88.0
4      Tom  16/01/2021  70.0     84.0      88.0
5     King  16/01/2021  70.0     77.0      88.0
6      Tom  16/01/2021  90.0     55.0      88.0
7     Mary  16/01/2021  76.0     55.0      70.0
8     Mary  16/01/2021  76.0     66.0      70.0

###### Impute null value with statistical measures

In [14]:
missing_data_df.fillna(missing_data_df.Math.mean()) # fillna null value in Math column with mean of the Math
missing_data_df.fillna(missing_data_df.Students.mode()) # fillna null value in Students column with mode of the Students
missing_data_df.fillna(missing_data_df.Computer.median()) # fillna null value in Computer column with median of the Computer

  Students   Exam_Date  Math  Physics  Computer
0      Tom  15/01/2021  79.0     63.0      74.0
1    Peter  16/01/2021  67.0     74.0      78.0
2       74  19/01/2021  74.0     60.0      57.0
3     Mary  27/01/2021  74.0     74.0      88.0
4      Tom  16/01/2021  70.0     84.0      74.0
5     King  16/01/2021  74.0     77.0      74.0
6      Tom  16/01/2021  90.0     55.0      74.0
7     Mary  16/01/2021  76.0     74.0      70.0
8       74  16/01/2021  74.0     66.0      74.0

### 3. Interpolate missing values
###### Interpolate missing data in forward direction

In [15]:
missing_data_df.interpolate(method='linear', limit_direction ='forward')

  Students   Exam_Date  Math  Physics  Computer
0      Tom  15/01/2021  79.0     63.0       NaN
1    Peter  16/01/2021  67.0     61.5      78.0
2      NaN  19/01/2021  68.0     60.0      57.0
3     Mary  27/01/2021  69.0     72.0      88.0
4      Tom  16/01/2021  70.0     84.0      83.5
5     King  16/01/2021  80.0     77.0      79.0
6      Tom  16/01/2021  90.0     55.0      74.5
7     Mary  16/01/2021  76.0     60.5      70.0
8      NaN  16/01/2021  76.0     66.0      70.0

###### Interpolate missing data in backward direction

In [16]:
missing_data_df.interpolate(method='linear', limit_direction ='backward')

  Students   Exam_Date  Math  Physics  Computer
0      Tom  15/01/2021  79.0     63.0      78.0
1    Peter  16/01/2021  67.0     61.5      78.0
2      NaN  19/01/2021  68.0     60.0      57.0
3     Mary  27/01/2021  69.0     72.0      88.0
4      Tom  16/01/2021  70.0     84.0      83.5
5     King  16/01/2021  80.0     77.0      79.0
6      Tom  16/01/2021  90.0     55.0      74.5
7     Mary  16/01/2021  76.0     60.5      70.0
8      NaN  16/01/2021   NaN     66.0       NaN

### 4. Model-based techniques
###### Nearest neighbors imputation

In [17]:
from sklearn.impute import KNNImputer

In [49]:
missing_data_df

  Students   Exam_Date  Math  Physics  Computer
0      Tom  15/01/2021  79.0     63.0       NaN
1    Peter  16/01/2021  67.0      NaN      78.0
2      NaN  19/01/2021   NaN     60.0      57.0
3     Mary  27/01/2021   NaN      NaN      88.0
4      Tom  16/01/2021  70.0     84.0       NaN
5     King  16/01/2021   NaN     77.0       NaN
6      Tom  16/01/2021  90.0     55.0       NaN
7     Mary  16/01/2021  76.0      NaN      70.0
8      NaN  16/01/2021   NaN     66.0       NaN

In [35]:
imputer = KNNImputer(n_neighbors=2, weights="uniform")
imputed_data=imputer.fit_transform(missing_data_df[['Math','Physics','Computer']].to_numpy())
imputed_data

array([[79. , 63. , 63.5],
       [67. , 73.5, 78. ],
       [84.5, 60. , 57. ],
       [71.5, 61.5, 88. ],
       [70. , 84. , 74. ],
       [74.5, 77. , 67.5],
       [90. , 55. , 63.5],
       [76. , 73.5, 70. ],
       [84.5, 66. , 67.5]])

In [48]:
pd.concat([missing_data_df[['Students','Exam_Date']],pd.DataFrame(imputed_data,columns=['Math','Physics','Computer'])],axis=1)

  Students   Exam_Date  Math  Physics  Computer
0      Tom  15/01/2021  79.0     63.0      63.5
1    Peter  16/01/2021  67.0     73.5      78.0
2      NaN  19/01/2021  84.5     60.0      57.0
3     Mary  27/01/2021  71.5     61.5      88.0
4      Tom  16/01/2021  70.0     84.0      74.0
5     King  16/01/2021  74.5     77.0      67.5
6      Tom  16/01/2021  90.0     55.0      63.5
7     Mary  16/01/2021  76.0     73.5      70.0
8      NaN  16/01/2021  84.5     66.0      67.5

# 2. Handling Imbalanced Data